In [21]:
import pandas as pd
import numpy as np
import mysql.connector

In [30]:
mydb=mysql.connector.connect(host='localhost',user='root',password='malay',
                             database='demo')

In [32]:

mycursor=mydb.cursor(buffered=True)
mycursor.execute('show tables')
for i in mycursor:
    print(i)

('companies',)
('companies_a',)
('customers',)
('demotable689',)
('department',)
('employee',)
('employee1',)
('female',)
('male',)
('my_basictable',)
('student_details',)
('student_details2',)
('students_depts',)
('test',)

In [44]:
mycursor.execute("select *from customers")
for i in mycursor:
    print(i)

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')

In [49]:
mycursor.execute("select *from customers")
list=[]
for i in mycursor:
    print(i)
    list.append(i)
x=pd.DataFrame(list)
x.columns=['name','adress']
x

('John', 'Highway 21')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')
('Peter', 'Lowstreet 4')
('Amy', 'Apple st 652')
('Hannah', 'Mountain 21')
('Michael', 'Valley 345')
('Sandy', 'Ocean blvd 2')
('Betty', 'Green Grass 1')
('Richard', 'Sky st 331')
('Susan', 'One way 98')
('Vicky', 'Yellow Garden 2')
('Ben', 'Park Lane 38')
('William', 'Central st 954')
('Chuck', 'Main Road 989')
('Viola', 'Sideway 1633')

       name           adress
0      John       Highway 21
1     Peter      Lowstreet 4
2       Amy     Apple st 652
3    Hannah      Mountain 21
4   Michael       Valley 345
5     Sandy     Ocean blvd 2
6     Betty    Green Grass 1
7   Richard       Sky st 331
8     Susan       One way 98
9     Vicky  Yellow Garden 2
10      Ben     Park Lane 38
11  William   Central st 954
12    Chuck    Main Road 989
13    Viola     Sideway 1633
14    Peter      Lowstreet 4
15      Amy     Apple st 652
16   Hannah      Mountain 21
17  Michael       Valley 345
18    Sandy     Ocean blvd 2
19    Betty    Green Grass 1
20  Richard       Sky st 331
21    Susan       One way 98
22    Vicky  Yellow Garden 2
23      Ben     Park Lane 38
24  William   Central st 954
25    Chuck    Main Road 989
26    Viola     Sideway 1633

In [63]:
mydb2=mysql.connector.connect(host='localhost',user='root',password='malay',database='test')

In [64]:
mycursor=mydb2.cursor(buffered=True)
mycursor.execute("show databases")

In [65]:
for i in mycursor:
    print(i)

('cases',)
('db1',)
('demo',)
('demo1',)
('employee2',)
('information_schema',)
('mysql',)
('performance_schema',)
('sakila',)
('sys',)
('test',)
('world',)
('xy',)

In [69]:
mycursor=mydb2.cursor(buffered=True)
mycursor.execute('show tables')
for i in mycursor:
    print(i)

('customers',)
('orders',)
('student_details',)
('students',)
('students3',)
('teachers',)
('usacustomers',)

In [72]:

mycursor=mydb2.cursor(buffered=True)
mycursor.execute("select * from customers")

In [73]:
for i in mycursor:
    print(i)

(2, 'robert', 'luna', 22, 'usa', None)
(3, 'david', 'robinson', 22, 'uk', None)
(4, 'john', 'reohardt', 25, 'uk', None)
(1, 'john', 'doe', 31, 'usa', None)
(6, 'alisha', 'sanam', 30, 'bangladesh', None)
(7, 'alisha', 'sanam', 33, 'india', None)
(7, 'alisha', 'sanam', 33, 'india', None)
(7, 'alisha', 'sanam', 33, 'india', None)

In [74]:
mycursor=mydb2.cursor(buffered=True)
mycursor.execute("select *from customers where name=luna")

ProgrammingError: 1054 (42S22): Unknown column 'name' in 'where clause'